{"abstract": "CLIBE: Detecting Dynamic Backdoors in Transformer-based NLP Models", "introduction": "In the realm of Natural Language Processing (NLP), the emergence of Transformer-based language models has marked a significant advancement. Initially, these models undergo pre-training on extensive text datasets, acquiring a nuanced understanding of language. They are then fine-tuned to address various NLP tasks such as toxic comment filtering, opinion mining, and neural machine translation. However, the increasing complexity and capacity of these models make fine-tuning a task that demands substantial computational resources and expertise. Consequently, there is a growing need to leverage pre-existing language models that have been fine-tuned and shared by experts online.", "future_direction": "Our work presents CLIBE, a novel framework designed to detect dynamic backdoors in Transformer-based NLP models. We demonstrate that CLIBE is effective in detecting various types of dynamic backdoor attacks. We also extend CLIBE to detect backdoor text generation models that are modified to exhibit toxic behavior. To the best of our knowledge, CLIBE is the first framework capable of detecting backdoors in text generation models without requiring access to trigger input test samples.", "research_gap": "The detection of backdoors in NLP models is a crucial task, but traditional methods primarily focus on static backdoors. There is a lack of research on detecting dynamic backdoors, which are more stealthy and pose a severe threat to the NLP model supply chain. Additionally, existing research on NLP backdoor detection primarily focuses on identifying static backdoors, leaving the detection of dynamic backdoors largely unexplored. Detecting dynamic backdoors is challenging due to their complex and varying triggers.", "conclusion": "Our framework, CLIBE, is designed to detect dynamic backdoors in Transformer-based NLP models. CLIBE presents a novel approach that leverages the abnormality of dynamic backdoors in the parameter space of the model. We demonstrate that CLIBE is effective in detecting various types of dynamic backdoor attacks. Our results show that CLIBE achieves a high detection rate and a low false positive rate on multiple datasets and models. We also extend CLIBE to detect backdoor text generation models that are modified to exhibit toxic behavior. Our results show that CLIBE is capable of detecting these models effectively. Our work provides a significant contribution to the field of NLP model security and demonstrates the effectiveness of CLIBE in detecting dynamic backdoors."}